backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def current_user

    header = request.headers['Authorization']

    token = header.split(' ').last if header

    decoded = JsonWebToken.decode(token)

    return nil unless decoded

    @current_user ||= User.find_by(
      id: decoded[:user_id]
    )