backend/app/controllers/api/v1/admin_controller.rb

SELECT "users".* FROM "users"
---
  def users
    render json: User.all

SELECT COUNT(*) FROM "users" WHERE "users"."role" = 'customer'
---
def stats
  render json: {
    users: User.count,
    workers: User.where(role: "worker").count,
    customers: User.where(role: "customer").count,
    jobs: Job.count,
    applications: JobApplication.count,
    reviews: Review.count

SELECT "job_applications".* FROM "job_applications"
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 9)
---
  def applications
    applications = JobApplication.includes(job: :customer, worker_profile: :user)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "status" = 'suspended', "updated_at" = '2026-06-30 11:28:53.236688' WHERE "users"."id" = 1
---
def activate_user
  user = User.find(params[:id])

  user.update(
    status: "active"
  )

SELECT "reviews".* FROM "reviews"
---
  def reviews
    render json: Review.all

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
UPDATE "users" SET "status" = 'suspended', "updated_at" = '2026-06-30 11:28:53.236688' WHERE "users"."id" = 1
---
  def suspend_user
  user = User.find(params[:id])

  user.update(
    status: "suspended"
  )