backend/app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "phone", "password_digest", "role", "status", "created_at", "updated_at") VALUES ('Venus', 'Kabera', 've.k@gmail.comm', '12345544', '$2a$12$wjpJK3KsPmJoqWFrUuPoeuQsbb7ZRsZgN9F3gDx1ER2l5wWqJ6dUu', 'customer', 'active', '2026-06-23 09:35:19.103922', '2026-06-23 09:35:19.103922') RETURNING "id"
INSERT INTO "users" ("first_name", "last_name", "email", "phone", "password_digest", "role", "status", "created_at", "updated_at") VALUES ('Venus', 'Kabera', 'venus@test.com', '0712345678', '$2a$12$6fjloVlv3mUchAHnXipWkutaeEvIAOEjFRIEElGeOyvGGZHhhRgfu', 'customer', 'active', '2026-06-19 09:56:03.360955', '2026-06-19 09:56:03.360955') RETURNING "id"
---
def register
  user = User.new(user_params)
  user.role = "customer" unless %w[customer worker].include?(user.role)  # ← add this line

  if user.save
    if user.role == "worker"
      profile = user.build_worker_profile(
        bio: "", location: user_params[:location].presence || "Nairobi",
        experience_years: 0, hourly_rate: 0
      )
      profile.save  # logged below if it ever fails, instead of silently dropping