backend/app/controllers/api/v1/job_applications_controller.rb

  def create
    application = JobApplication.create(
      job_id: params[:job_id],
      worker_profile_id: current_user.worker_profile.id,
      status: "pending"
    )
---
INSERT INTO "job_applications" ("job_id", "worker_profile_id", "status", "created_at", "updated_at") VALUES (1, 2, 'pending', '2026-06-29 14:33:35.787350', '2026-06-29 14:33:35.787350') RETURNING "id"