backend/app/controllers/api/v1/jobs_controller.rb

def applicants
  job = Job.find(params[:id])

  render json: job.job_applications.includes(
    :worker_profile
  )
---
SELECT "job_applications".* FROM "job_applications" WHERE "job_applications"."job_id" = 1
SELECT "worker_profiles".* FROM "worker_profiles" WHERE "worker_profiles"."id" = 2