backend/app/controllers/api/v1/messages_controller.rb

  def index
    messages = Message.where(job_id: params[:job_id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."job_id" IS NULL