backend/app/controllers/api/v1/notifications_controller.rb

  def update
    notification = current_user.notifications.find(params[:id])
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = 1