backend/app/controllers/api/v1/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
  def index
    render json: Review.all