backend/app/controllers/api/v1/worker_profiles_controller.rb

SELECT "worker_profiles".* FROM "worker_profiles"
---
 def index
  workers = WorkerProfile.includes(:skills)

INSERT INTO "worker_profiles" ("user_id", "bio", "location", "experience_years", "hourly_rate", "verified", "average_rating", "created_at", "updated_at") VALUES (1, 'Certified electrician with 5 years experience', 'Nairobi', 5, 1500.0, FALSE, NULL, '2026-06-19 10:27:32.323336', '2026-06-19 10:27:32.323336') RETURNING "id"
---
  def create
    profile = current_user.create_worker_profile(
      worker_profile_params
    )

SELECT "worker_profiles".* FROM "worker_profiles" WHERE "worker_profiles"."id" = 1 LIMIT 1
---
  def show
    profile = WorkerProfile.find(params[:id])

SELECT "worker_profiles".* FROM "worker_profiles" WHERE "worker_profiles"."id" = NULL LIMIT 1
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."worker_profile_id" = 1
---
  def rating
    worker = WorkerProfile.find(params[:id])

    render json: {
      average_rating: worker.average_rating,
      reviews_count: worker.reviews.count