backend/app/controllers/api/v1/worker_profiles_controller.rb

def my_profile
  profile = current_user.worker_profile ||
            current_user.create_worker_profile(
              bio: "", location: "Nairobi", experience_years: 0, hourly_rate: 0
            )

  render json: {
    id: profile.id,
    bio: profile.bio,
    location: profile.location,
    experience_years: profile.experience_years,
    hourly_rate: profile.hourly_rate,
    average_rating: profile.average_rating,   # add this
    reviews_count: profile.reviews.count,     # add this
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."worker_profile_id" = 2

def show
  worker = WorkerProfile.find(params[:id])
---
SELECT "worker_profiles".* FROM "worker_profiles" WHERE "worker_profiles"."id" = NULL LIMIT 1